---
kind: type
id: T:Autodesk.Revit.DB.DuplicateTypeAction
source: html/edea3b11-e447-7ca1-bd8b-7d6709c5a699.htm
---
# Autodesk.Revit.DB.DuplicateTypeAction

This enumerated type defines the action to be taken when there are types with the same name being pasted.

## Syntax (C#)
```csharp
public enum DuplicateTypeAction
```